---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisResultSchema.#ctor(System.String,System.String)
source: html/0542e49c-db7e-365a-53a4-30456fd534b7.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisResultSchema.#ctor Method

Creates object and assigns name and description

## Syntax (C#)
```csharp
public AnalysisResultSchema(
	string name,
	string description
)
```

## Parameters
- **name** (`System.String`) - Name of the result schema
- **description** (`System.String`) - Description of the result schema

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null